[Challenges.Challenge_Iris_BuyTorgueItems ChallengeDefinition]
Description="Purchase Torgue items with Tokens."

[Challenges.Challenge_Iris_BuyTorgueItems:ChallengeConditionDefinition_10 ChallengeConditionDefinition]
Description="Purchase 2 Torgue items"

[Challenges.Challenge_Iris_BuyTorgueItems:ChallengeConditionDefinition_11 ChallengeConditionDefinition]
Description="Purchase 5 Torgue items"

[Challenges.Challenge_Iris_BuyTorgueItems:ChallengeConditionDefinition_12 ChallengeConditionDefinition]
Description="Purchase 8 Torgue items"

[Challenges.Challenge_Iris_BuyTorgueItems:ChallengeConditionDefinition_13 ChallengeConditionDefinition]
Description="Purchase 12 Torgue items"

[Challenges.Challenge_Iris_BuyTorgueItems:ChallengeConditionDefinition_14 ChallengeConditionDefinition]
Description="Purchase 15 Torgue items"

[Challenges.Challenge_Iris_CompleteBattles ChallengeDefinition]
Description="Complete all battles."

[Challenges.Challenge_Iris_CompleteBattles:ChallengeConditionDefinition_15 ChallengeConditionDefinition]
Description="Complete 1 battle"

[Challenges.Challenge_Iris_CompleteBattles:ChallengeConditionDefinition_16 ChallengeConditionDefinition]
Description="Complete 4 battles"

[Challenges.Challenge_Iris_CompleteBattles:ChallengeConditionDefinition_17 ChallengeConditionDefinition]
Description="Complete 8 battles"

[Challenges.Challenge_Iris_CompleteBattles:ChallengeConditionDefinition_18 ChallengeConditionDefinition]
Description="Complete 12 battles"

[Challenges.Challenge_Iris_KillBikers ChallengeDefinition]
Description="Kill bikers."

[Challenges.Challenge_Iris_KillBikers:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 50 bikers"

[Challenges.Challenge_Iris_KillBikers:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 100 bikers"

[Challenges.Challenge_Iris_KillBikers:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 bikers"

[Challenges.Challenge_Iris_KillBikers:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 200 bikers"

[Challenges.Challenge_Iris_KillBikers:ChallengeConditionDefinition_9 ChallengeConditionDefinition]
Description="Kill 250 bikers"

[Challenges.Challenge_Iris_KillMotorcycles ChallengeDefinition]
Description="Destroy bikes."

[Challenges.Challenge_Iris_KillMotorcycles:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Destroy 80 bikes"

[Challenges.Challenge_Iris_KillMotorcycles:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Destroy 10 bikes"

[Challenges.Challenge_Iris_KillMotorcycles:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Destroy 20 bikes"

[Challenges.Challenge_Iris_KillMotorcycles:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Destroy 30 bikes"

[Challenges.Challenge_Iris_KillMotorcycles:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Destroy 50 bikes"

[Challenges.Challenge_Iris_Raid1:ChallengeConditionDefinition_20 ChallengeConditionDefinition]
Description="Defeat Pete the Invincible once"

[Challenges.Challenge_Iris_Raid1:ChallengeConditionDefinition_21 ChallengeConditionDefinition]
Description="Defeat Pete the Invincible 3 times"

[Challenges.Challenge_Iris_Raid1:ChallengeConditionDefinition_22 ChallengeConditionDefinition]
Description="Defeat Pete the Invincible 5 times"

[Challenges.Challenge_Iris_Raid1:ChallengeConditionDefinition_23 ChallengeConditionDefinition]
Description="Defeat Pete the Invincible 10 times"

[Challenges.Challenge_Iris_Raid1:ChallengeConditionDefinition_24 ChallengeConditionDefinition]
Description="Defeat Pete the Invincible 15 times"

[LevelChallenges.Arena_NotEntertained ChallengeDefinition]
Description="Finish tier 3 of Appetite for Destruction."

[LevelChallenges.Beatdown_IThoughtBigger ChallengeDefinition]
ChallengeName="I Thought You'd Be... Bigger"

[LevelChallenges.Crater_AsAdvertised ChallengeDefinition]
Description="Find the 2 treasure chests hidden behind the signs."

[LevelChallenges.Crater_FanclubMembership ChallengeDefinition]
Description="Find the hut on the Crater rim."
